{
    "meta": {
        "description": "Portfolio of Bruno Seilliebert, 3rd year computer science student at Gustave Eiffel University"
    },
    "nav": {
        "main": "Home",
        "about": "About",
        "projects": "Projects",
        "contact": "Contact"
    },
    "main-text": "3rd year Computer Science student at Gustave Eiffel University",
    "about-me": "About me",
    "school-career-title": "Education",
    "school-career": {
        "l3": {
            "id": "l3",
            "images": [
                {
                    "src": "img/universite-gustave-eiffel.jpg",
                    "alt": "Gustave Eiffel University logo"
                },
                {
                    "src": "img/logo-carre-kynova.jpg",
                    "alt": "Kynova logo"
                }
            ],
            "title": "3rd year Computer Science student at Gustave Eiffel University, working at Kynova as an apprentice",
            "text": "In my third year of studies, I completed an internship at Kynova, a communication agency, in order to gain professional experience and apply the theoretical knowledge I had acquired in class.<br>At the same time, during my courses, I discovered Java development and networking. I took classes in compilation, functional programming, system programming, and graph algorithms. I also had the opportunity to deepen my knowledge in C and databases."
        },
        "l1-l2": {
            "id": "l1-l2",
            "images": [
                {
                    "src": "img/universite-gustave-eiffel.jpg",
                    "alt": "Gustave Eiffel University logo"
                }
            ],
            "title": "1st and 2nd year Computer Science student at Gustave Eiffel University",
            "text": "In September 2020, I joined Gustave Eiffel University to pursue a degree in Computer Science.<br>The first year of the program is common to the Mathematics degree, so I was able to take classes in both Mathematics and Programming and Algorithms in Python and JavaScript.<br>The second year is more focused on Computer Science, so I was able to start learning C, continue with Python, and also discover topics such as databases, automata, and tree algorithms"
        },
        "lycee": {
            "id": "lycee",
            "images": [
                {
                    "src": "img/lycee-champlain.webp",
                    "alt": "Champlain High School"
                }
            ],
            "title": "Bachelor of Science from Champlain High School",
            "text": "In 2019, I obtained my french scientific baccalauréat with a focus on life and earth sciences. Following this, I enrolled in the first year of health studies (PACES) at the University of Paris-Est Créteil. After a year, I decided to change my path and pursue a degree in Computer Science."
        }
    },
    "projects-title": "Projects",
    "projects": {
        "school": {
            "id": "school",
            "small-title": "Academic",
            "title": "Academic Projects",
            "text": "Here is a list of projects I have completed as part of my studies.",
            "projects": [
                {
                    "id": "stealth",
                    "title": "2D Stealth Game",
                    "languages": [
                        "C"
                    ],
                    "images": [
                        {
                            "src": "img/stealth",
                            "alt": "Screenshot of the Stealth game"
                        }
                    ],
                    "text": "A 2D stealth game project developed using C programming language and the university's graphic library based on SDL2. The objective of the game is to retrieve objects in the room without being detected by guards. The player collects mana as they move and can use spells to move faster or become invisible.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/stealth",
                            "text": "View source code"
                        }
                    ]
                },
                {
                    "id": "patchwork",
                    "title": "Patchwork Game",
                    "languages": [
                        "Java"
                    ],
                    "images": [
                        {
                            "src": "img/patchwork",
                            "alt": "Screenshot of the Patchwork game"
                        }
                    ],
                    "text": "A version of the Patchwork game developed using Java programming language. The objective of the game is to fill the game board with tiles and move the player's pawn to the finish line. This project was developed in a team of two and includes a graphical user interface (also using a library provided by the university) and a command-line interface.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/Patchwork",
                            "text": "View source code"
                        }
                    ]
                },
                {
                    "id": "les-archives-de-babel",
                    "title": "Les archives de Babel",
                    "languages": [
                        "PHP",
                        "PgSQL"
                    ],
                    "images": [],
                    "text": "A website project developed using PHP with a PostgreSQL database for the second-year database course. The website displays scientific articles (which were scraped by me from the web outside of the project). This project was developed in a team of two.",
                    "links": [
                        {
                            "href": "https://upem.brunoseilliebert.com/Projets/babel/",
                            "text": "View an archive of the site"
                        }
                    ]
                },
                {
                    "id": "slitherlink",
                    "title": "Slitherlink Game",
                    "languages": [
                        "Python"
                    ],
                    "images": [],
                    "text": "A board game project developed in Python and the university's graphic library during the first year of studies. The objective of the game is to connect the cells together while respecting the numbers indicated. This project aimed to introduce the concept of recursion to the students.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/slitherlink-python",
                            "text": "View source code"
                        },
                        {
                            "href": "https://replit.com/[at]bruno00o/slitherlink?v=1",
                            "text": "Play online"
                        }
                    ]
                },
                {
                    "id": "attaxx",
                    "title": "Attaxx Game",
                    "languages": [
                        "C"
                    ],
                    "images": [],
                    "text": "A board game project developed in C and the university's graphic library based on SDL2 during the second year of studies. The objective of the game is to capture all the cells on the board. This project was developed in a team of two and aimed to introduce students to C programming language and the graphic library.",
                    "links": []
                }
            ]
        },
        "personal": {
            "id": "personal",
            "small-title": "Personal",
            "title": "Personal Projects",
            "text": "Here is a list of projects I have completed outside of my studies.",
            "projects": [
                {
                    "id": "aroma-uge",
                    "title": "Website allowing University Gustave Eiffel students to view their schedules and those of their friends",
                    "languages": [
                        "Vue.js",
                        "Node.js",
                        "Express.js"
                    ],
                    "images": [
                        {
                            "src": "img/aroma-uge",
                            "alt": "Screenshot of the Aroma UGE website"
                        }
                    ],
                    "text": "Website allowing University Gustave Eiffel students to view their schedules and those of their friends. The website is made with Vue.js and Node.js with Express.js. The data is automatically retrieved from the university's digital work environment",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/aroma-uge",
                            "text": "View source code"
                        },
                        {
                            "href": "https://aroma-uge.tech",
                            "text": "View website"
                        }
                    ]
                },
                {
                    "id": "signal-home",
                    "title": "Python script sending a message on Signal when a family member returns home",
                    "languages": [
                        "Python"
                    ],
                    "images": [
                        {
                            "src": "img/signal-home",
                            "alt": "Screenshot of the Signal Home script"
                        }
                    ],
                    "text": "Python script sending a message on Signal when a family member returns home. The script is made in Python and uses the Freebox API as well as a <a href=\"https://github.com/bbernhard/signal-cli-rest-api\">GitHub repository</a> allowing to use Signal on a server.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/signal-home",
                            "text": "View source code"
                        }
                    ]
                }
            ]
        }
    },
    "contact-me-title": "Contact",
    "contact-me-text": "You can also contact me using the form below.",
    "contact-me": {
        "name": "Name",
        "email": "Email",
        "tel": "Phone number (optional)",
        "message": "Your message",
        "send": "Send",
        "success": "Your message has been successfully sent!",
        "error": "An error occurred while sending your message."
    }
}