{
    "meta": {
        "description": "Portfolio of Bruno Seilliebert, 3rd year computer science student at Gustave Eiffel University"
    },
    "nav": {
        "main": "Home",
        "about": "About",
        "projects": "Projects",
        "contact": "Contact"
    },
    "main-text": "3rd year Computer Science student at Gustave Eiffel University",
    "about-me": "About me",
    "school-career-title": "Education",
    "school-career": {
        "l3": {
            "id": "l3",
            "images": [
                {
                    "src": "img/universite-gustave-eiffel.jpg",
                    "alt": "Gustave Eiffel University logo"
                },
                {
                    "src": "img/logo-carre-kynova.jpg",
                    "alt": "Kynova logo"
                }
            ],
            "title": "3rd year Computer Science student at Gustave Eiffel University, working at Kynova as an apprentice",
            "text": "I chose to do my third year as an apprentice so that I could apply what I learned in class and gain experience in the workplace. Therefore, I chose to do my apprenticeship at Kynova, a communication agency where I was hired as a web developer.<br>Parallel to my apprenticeship, I am taking advanced programming courses in C and database, discovering Java as well as functional programming in Haskell. I am also taking courses in compilation, networks, and graph algorithms."
        },
        "l1-l2": {
            "id": "l1-l2",
            "images": [
                {
                    "src": "img/universite-gustave-eiffel.jpg",
                    "alt": "Gustave Eiffel University logo"
                }
            ],
            "title": "1st and 2nd year Computer Science student at Gustave Eiffel University",
            "text": "In September 2020, I joined Gustave Eiffel University to do a Computer Science degree.<br>The first year being common to the Mathematics degree, I was able to take courses in mathematics as well as programming and algorithms in Python and JavaScript.<br>The second year is more focused on computer science, so I was able to start learning C, continue with Python, but also discover databases, automata, and tree algorithms."
        },
        "lycee": {
            "id": "lycee",
            "images": [
                {
                    "src": "img/lycee-champlain.webp",
                    "alt": "Champlain High School"
                }
            ],
            "title": "Bachelor of Science from Champlain High School",
            "text": "In 2019, I obtained my Bachelor of Science with an option in Life and Earth Sciences. Following that, I joined the first year of common health studies (PACES) at the University of Paris-Est Créteil. However, I decided to change paths and do a Computer Science degree at Gustave Eiffel University."
        }
    },
    "projects-title": "Projects",
    "projects": {
        "school": {
            "id": "school",
            "small-title": "Academic",
            "title": "Academic Projects",
            "text": "Here is a list of projects I have completed as part of my studies.",
            "projects": [
                {
                    "id": "stealth",
                    "title": "2D Stealth Game",
                    "languages": [
                        "C"
                    ],
                    "images": [
                        {
                            "src": "img/stealth",
                            "alt": "Screenshot of the Stealth game"
                        }
                    ],
                    "text": "2D stealth game made in C with the university's graphic library based on SDL2. The objective of the game is to collect objects in the room without being detected by the guards. The player collects mana while moving and can use spells to move faster or become invisible.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/stealth",
                            "text": "View source code"
                        }
                    ]
                },
                {
                    "id": "patchwork",
                    "title": "Patchwork Game",
                    "languages": [
                        "Java"
                    ],
                    "images": [
                        {
                            "src": "img/patchwork",
                            "alt": "Screenshot of the Patchwork game"
                        }
                    ],
                    "text": "Version of the Patchwork game made in Java. The goal of the game is to fill the board with tiles and move the pawn to the finish line.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/Patchwork",
                            "text": "View source code"
                        }
                    ]
                }
            ]
        },
        "personal": {
            "id": "personal",
            "small-title": "Personal",
            "title": "Personal Projects",
            "text": "Here is a list of projects I have completed outside of my studies.",
            "projects": [
                {
                    "id": "aroma-uge",
                    "title": "Website allowing University Gustave Eiffel students to view their schedules and those of their friends",
                    "languages": [
                        "Vue.js",
                        "Node.js",
                        "Express.js"
                    ],
                    "images": [
                        {
                            "src": "img/aroma-uge",
                            "alt": "Screenshot of the Aroma UGE website"
                        }
                    ],
                    "text": "Website allowing University Gustave Eiffel students to view their schedules and those of their friends. The website is made with Vue.js and Node.js with Express.js. The data is automatically retrieved from the university's ENT",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/aroma-uge",
                            "text": "View source code"
                        },
                        {
                            "href": "https://aroma-uge.tech",
                            "text": "View website"
                        }
                    ]
                },
                {
                    "id": "signal-home",
                    "title": "Python script sending a message on Signal when a family member returns home",
                    "languages": [
                        "Python"
                    ],
                    "images": [
                        {
                            "src": "img/signal-home",
                            "alt": "Screenshot of the Signal Home script"
                        }
                    ],
                    "text": "Python script sending a message on Signal when a family member returns home. The script is made in Python and uses the Freebox API as well as a <a href=\"https://github.com/bbernhard/signal-cli-rest-api\">GitHub repository</a> allowing to use Signal on a server.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/signal-home",
                            "text": "View source code"
                        }
                    ]
                }
            ]
        }
    },
    "contact-me-title": "Contact"
}