{
    "meta": {
        "description": "Portfolio de Bruno Seilliebert, étudiant en 3ème année de licence informatique à l'Université Gustave Eiffel"
    },
    "nav": {
        "main": "Accueil",
        "about": "À propos",
        "projects": "Projets",
        "contact": "Contact"
    },
    "main-text": "Etudiant en 3ème année de Licence Informatique à l'Université Gustave Eiffel",
    "about-me": "À propos de moi",
    "school-career-title": "Formation",
    "school-career": {
        "l3": {
            "id": "l3",
            "images": [
                {
                    "src": "img/universite-gustave-eiffel",
                    "alt": "Logo de l'université Gustave Eiffel"
                },
                {
                    "src": "img/logo-carre-kynova",
                    "alt": "Logo de Kynova"
                }
            ],
            "title": "3ème année de licence informatique à l'Université Gustave Eiffel, en alternance chez Kynova",
            "text": "En 3ème année, afin d'acquérir de l'expérience professionnelle et d'appliquer les connaissances théoriques acquises en cours, j'ai effectué une alternance chez Kynova, une agence de communication.<br>Parallèlement, en cours, j'ai découvert le développement en Java et le réseaux. J'ai suivi des cours de compilation, de programmation fonctionnelle, de programmation système et d'algorithmique des graphes. J'ai également pu approfondir mes connaissances en C et en base de données."
        },
        "l1-l2": {
            "id": "l1-l2",
            "images": [
                {
                    "src": "img/universite-gustave-eiffel",
                    "alt": "Logo de l'université Gustave Eiffel"
                }
            ],
            "title": "1ère et 2ème année de licence informatique à l'Université Gustave Eiffel",
            "text": "En septembre 2020, j'intègre l'Université Gustave Eiffel pour faire une licence informatique.<br>La première année étant commune à la licence de mathématiques, j'ai pu suivre des cours de mathématiques ainsi que des cours de programmation et d'algorithmique en Python et JavaScript.<br>La deuxième année est plus orientée informatique, j'y ai donc pu débuter le C, poursuivre le Python mais aussi découvrir la base de données, les automates ou encore l'algorithmique des arbres."
        },
        "lycee": {
            "id": "lycee",
            "images": [
                {
                    "src": "img/lycee-champlain",
                    "alt": "Lycée Champlain"
                }
            ],
            "title": "Baccalauréat scientifique au lycée Champlain",
            "text": "En 2019, j'obtiens mon baccalauréat scientifique option sciences de la vie et de la terre. Suite à cela, j'intègre la première année commune aux études de santé (PACES) à l'Université Paris-Est Créteil. Après une année, je décide de changer de voie et de faire une licence informatique."
        }
    },
    "projects-title": "Projets",
    "projects": {
        "school": {
            "id": "school",
            "small-title": "Universitaires",
            "title": "Projets Universitaires",
            "text": "Voici une liste de projets que j'ai réalisé dans le cadre de mes études.",
            "projects": [
                {
                    "id": "stealth",
                    "title": "Jeu d'infiltration en 2D",
                    "languages": [
                        "C"
                    ],
                    "images": [
                        {
                            "src": "img/stealth",
                            "alt": "Capture d'écran du jeu Stealth"
                        }
                    ],
                    "text": "Projet de jeu d'infiltration en 2D réalisé en C avec la bibliothèque graphique de l'université basée sur SDL2. Le but du jeu est de récupérer les objets dans la pièce sans se faire repérer par les gardes. Le joueur ramasse du mana en se déplaçant et peut utiliser des sorts pour se déplacer plus rapidement ou pour devenir invisible.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/stealth",
                            "text": "Voir le code source"
                        }
                    ]
                },
                {
                    "id": "patchwork",
                    "title": "Jeu du Patchwork",
                    "languages": [
                        "Java"
                    ],
                    "images": [
                        {
                            "src": "img/patchwork",
                            "alt": "Capture d'écran du jeu Patchwork"
                        }
                    ],
                    "text": "Version du jeu du Patchwork réalisée en Java. Le but du jeu est de remplir son plateau de tuiles et de déplacer son pion jusqu'à la ligne d'arrivée. Ce projet, réalisé en binome, comporte une interface graphique (toujours avec une librairie de l'université) et une interface en ligne de commande.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/Patchwork",
                            "text": "Voir le code source"
                        }
                    ]
                },
                {
                    "id": "les-archives-de-babel",
                    "title": "Les archives de Babel",
                    "languages": [
                        "PHP",
                        "PgSQL"
                    ],
                    "images": [],
                    "text": "Projet de site web réalisé en PHP avec une base de données PostgreSQL dans le cadre du cours de base de données de 2ème année. Le site affiche des articles scientifiques (que j'ai scrapé sur le web en dehors du projet). Ce projet a été réalisé en binome.",
                    "links": [
                        {
                            "href": "https://upem.brunoseilliebert.com/Projets/babel/",
                            "text": "Voir une archive du site"
                        }
                    ]
                },
                {
                    "id": "slitherlink",
                    "title": "Jeu Slitherlink",
                    "languages": [
                        "Python"
                    ],
                    "images": [],
                    "text": "Projet de jeu de plateau réalisé en Python avec la bibliothèque graphique de l'université en 1ère année. Le but du jeu est de relier les cases entre elles en respectant les nombres indiqués. Ce projet avait pour but de nous familiariser avec le concept de la récursivité.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/slitherlink-python",
                            "text": "Voir le code source"
                        },
                        {
                            "href": "https://replit.com/[at]bruno00o/slitherlink?v=1",
                            "text": "Voir le jeu en ligne"
                        }
                    ]
                },
                {
                    "id": "attaxx",
                    "title": "Jeu Attaxx",
                    "languages": [
                        "C"
                    ],
                    "images": [],
                    "text": "Projet de jeu de plateau réalisé en C avec la bibliothèque graphique de l'université basée sur SDL2. Le but du jeu est de capturer toutes les cases du plateau. Ce projet, réalisé en binome en 2ème année, avait pour but de nous faire découvrir la programmation en C ainsi que la librairie graphique.",
                    "links": []
                }
            ]
        },
        "personal": {
            "id": "personal",
            "small-title": "Personnels",
            "title": "Projets Personnels",
            "text": "Voici une liste de projets que j'ai réalisé en dehors de mes études.",
            "projects": [
                {
                    "id": "aroma-uge",
                    "title": "Site web permettant aux étudiants de l'Université Gustave Eiffel de consulter leur emploi du temps et celui de leurs amis",
                    "languages": [
                        "Vue.js",
                        "Node.js",
                        "Express.js"
                    ],
                    "images": [
                        {
                            "src": "img/aroma-uge",
                            "alt": "Capture d'écran du site web Aroma UGE"
                        }
                    ],
                    "text": "Site web permettant aux étudiants de l'Université Gustave Eiffel de consulter leur emploi du temps et celui de leurs amis. Le site web est réalisé en Vue.js et Node.js avec Express.js. Les données sont récupérées automatiquement depuis l'ENT de l'université",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/aroma-uge",
                            "text": "Voir le code source"
                        },
                        {
                            "href": "https://aroma-uge.tech",
                            "text": "Voir le site web"
                        }
                    ]
                },
                {
                    "id": "signal-home",
                    "title": "Script Python envoyant un message sur Signal lorsqu'un membre de la famille rentre à la maison",
                    "languages": [
                        "Python"
                    ],
                    "images": [
                        {
                            "src": "img/signal-home",
                            "alt": "Capture d'écran du script Signal Home"
                        }
                    ],
                    "text": "Script python envoyant un message sur Signal lorsqu'un membre de la famille rentre à la maison. Le script est réalisé en Python et utilise l'api de la Freebox ainsi qu'un <a href=\"https://github.com/bbernhard/signal-cli-rest-api\">repo GitHub</a> permettant d'utiliser Signal sur un serveur.",
                    "links": [
                        {
                            "href": "https://github.com/bruno00o/signal-home",
                            "text": "Voir le code source"
                        }
                    ]
                }
            ]
        }
    },
    "contact-me-title": "Contact",
    "contact-me-linkedin": "Vous pouvez me contacter sur <a href=\"https://www.linkedin.com/in/bruno-seilliebert/\">LinkedIn</a>.",
    "contact-me-text": "Vous pouvez aussi me contacter via le formulaire ci-dessous.",
    "contact-me": {
        "name": "Nom",
        "email": "Email",
        "tel": "Téléphone (facultatif)",
        "message": "Votre message",
        "send": "Envoyer",
        "success": "Votre message a bien été envoyé !",
        "error": "Une erreur est survenue lors de l'envoi de votre message."
    }
}